In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.523433  1.846226
1    a  two -0.561851  0.273050
2    b  one -1.377864 -1.524898
3    b  two  0.348560  0.417314
4    a  one -1.317889 -0.023145

In [2]:
s_gb = df['data1'].groupby(by=df['key1'])
len(s_gb)
s_gb.sum()

key1
a   -1.356307
b   -1.029303
Name: data1, dtype: float64

In [3]:
s_gb1 = df['data1'].groupby(by=[df['key1'],df['key2']])
len(s_gb1)
s2d = s_gb1.sum()
s2d.unstack()

key2       one       two
key1
a    -0.794456 -0.561851
b    -1.377864  0.348560

In [4]:
s_gb1 = df['data1'].groupby(by=[df['key1'],df['key2']])
len(s_gb1)
s2d = s_gb1.sum()
s2d.unstack()

key2       one       two
key1
a    -0.794456 -0.561851
b    -1.377864  0.348560

In [7]:
#Dataframe.groupby()
d_gb=df.groupby(by='key1')
d_gb['data1'].sum()

key1
a   -1.356307
b   -1.029303
Name: data1, dtype: float64

In [8]:
#Dataframe.groupby()
s2d1=d_gb=df.groupby(by=['key1','key2'])['data1'].sum()
s2d1.unstack()

key2       one       two
key1
a    -0.794456 -0.561851
b    -1.377864  0.348560